stress-test/pilot-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: stress-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 100 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 100 VUs  0m01.0s/2m0s

running (0m02.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 100 VUs  0m02.0s/2m0s

running (0m03.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 100 VUs  0m03.0s/2m0s

running (0m04.0s), 100/100 VUs, 1 complete and 0 interrupted iterations
default   [   3% ] 100 VUs  0m04.0s/2m0s

running (0m05.0s), 100/100 VUs, 16 complete and 0 interrupted iterations
default   [   4% ] 100 VUs  0m05.0s/2m0s

running (0m06.0s), 100/100 VUs, 42 complete and 0 interrupted iterations
default   [   5% ] 100 VUs  0m06.0s/2m0s

running (0m07.0s), 100/100 VUs, 74 complete and 0 interrupted iterations
default   [   6% ] 100 VUs  0m07.0s/2m0s

running (0m08.0s), 100/100 VUs, 105 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  0m08.0s/2m0s

running (0m09.0s), 100/100 VUs, 118 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  0m09.0s/2m0s

running (0m10.0s), 100/100 VUs, 146 complete and 0 interrupted iterations
default   [   8% ] 100 VUs  0m10.0s/2m0s

running (0m11.0s), 100/100 VUs, 174 complete and 0 interrupted iterations
default   [   9% ] 100 VUs  0m11.0s/2m0s

running (0m12.0s), 100/100 VUs, 207 complete and 0 interrupted iterations
default   [  10% ] 100 VUs  0m12.0s/2m0s

running (0m13.0s), 100/100 VUs, 226 complete and 0 interrupted iterations
default   [  11% ] 100 VUs  0m13.0s/2m0s

running (0m14.0s), 100/100 VUs, 241 complete and 0 interrupted iterations
default   [  12% ] 100 VUs  0m14.0s/2m0s

running (0m15.0s), 100/100 VUs, 274 complete and 0 interrupted iterations
default   [  12% ] 100 VUs  0m15.0s/2m0s

running (0m16.0s), 100/100 VUs, 305 complete and 0 interrupted iterations
default   [  13% ] 100 VUs  0m16.0s/2m0s

running (0m17.0s), 100/100 VUs, 321 complete and 0 interrupted iterations
default   [  14% ] 100 VUs  0m17.0s/2m0s

running (0m18.0s), 100/100 VUs, 342 complete and 0 interrupted iterations
default   [  15% ] 100 VUs  0m18.0s/2m0s

running (0m19.0s), 100/100 VUs, 366 complete and 0 interrupted iterations
default   [  16% ] 100 VUs  0m19.0s/2m0s

running (0m20.0s), 100/100 VUs, 400 complete and 0 interrupted iterations
default   [  17% ] 100 VUs  0m20.0s/2m0s

running (0m21.0s), 100/100 VUs, 428 complete and 0 interrupted iterations
default   [  17% ] 100 VUs  0m21.0s/2m0s

running (0m22.0s), 100/100 VUs, 443 complete and 0 interrupted iterations
default   [  18% ] 100 VUs  0m22.0s/2m0s

running (0m23.0s), 100/100 VUs, 470 complete and 0 interrupted iterations
default   [  19% ] 100 VUs  0m23.0s/2m0s

running (0m24.0s), 100/100 VUs, 498 complete and 0 interrupted iterations
default   [  20% ] 100 VUs  0m24.0s/2m0s

running (0m25.0s), 100/100 VUs, 520 complete and 0 interrupted iterations
default   [  21% ] 100 VUs  0m25.0s/2m0s

running (0m26.0s), 100/100 VUs, 551 complete and 0 interrupted iterations
default   [  22% ] 100 VUs  0m26.0s/2m0s

running (0m27.0s), 100/100 VUs, 570 complete and 0 interrupted iterations
default   [  22% ] 100 VUs  0m27.0s/2m0s

running (0m28.0s), 100/100 VUs, 594 complete and 0 interrupted iterations
default   [  23% ] 100 VUs  0m28.0s/2m0s

running (0m29.0s), 100/100 VUs, 622 complete and 0 interrupted iterations
default   [  24% ] 100 VUs  0m29.0s/2m0s

running (0m30.0s), 100/100 VUs, 649 complete and 0 interrupted iterations
default   [  25% ] 100 VUs  0m30.0s/2m0s

running (0m31.0s), 100/100 VUs, 676 complete and 0 interrupted iterations
default   [  26% ] 100 VUs  0m31.0s/2m0s

running (0m32.0s), 100/100 VUs, 696 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  0m32.0s/2m0s

running (0m33.0s), 100/100 VUs, 724 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  0m33.0s/2m0s

running (0m34.0s), 100/100 VUs, 752 complete and 0 interrupted iterations
default   [  28% ] 100 VUs  0m34.0s/2m0s

running (0m35.0s), 100/100 VUs, 775 complete and 0 interrupted iterations
default   [  29% ] 100 VUs  0m35.0s/2m0s

running (0m36.0s), 100/100 VUs, 797 complete and 0 interrupted iterations
default   [  30% ] 100 VUs  0m36.0s/2m0s

running (0m37.0s), 100/100 VUs, 812 complete and 0 interrupted iterations
default   [  31% ] 100 VUs  0m37.0s/2m0s

running (0m38.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  32% ] 100 VUs  0m38.0s/2m0s

running (0m39.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  32% ] 100 VUs  0m39.0s/2m0s

running (0m40.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  33% ] 100 VUs  0m40.0s/2m0s

running (0m41.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  34% ] 100 VUs  0m41.0s/2m0s

running (0m42.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  35% ] 100 VUs  0m42.0s/2m0s

running (0m43.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  36% ] 100 VUs  0m43.0s/2m0s

running (0m44.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  37% ] 100 VUs  0m44.0s/2m0s

running (0m45.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  37% ] 100 VUs  0m45.0s/2m0s

running (0m46.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  38% ] 100 VUs  0m46.0s/2m0s

running (0m47.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  39% ] 100 VUs  0m47.0s/2m0s

running (0m48.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  40% ] 100 VUs  0m48.0s/2m0s

running (0m49.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  41% ] 100 VUs  0m49.0s/2m0s

running (0m50.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  42% ] 100 VUs  0m50.0s/2m0s

running (0m51.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  42% ] 100 VUs  0m51.0s/2m0s

running (0m52.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  43% ] 100 VUs  0m52.0s/2m0s

running (0m53.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  44% ] 100 VUs  0m53.0s/2m0s

running (0m54.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  45% ] 100 VUs  0m54.0s/2m0s

running (0m55.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  46% ] 100 VUs  0m55.0s/2m0s

running (0m56.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  0m56.0s/2m0s

running (0m57.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  0m57.0s/2m0s

running (0m58.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  48% ] 100 VUs  0m58.0s/2m0s

running (0m59.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  49% ] 100 VUs  0m59.0s/2m0s

running (1m00.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  50% ] 100 VUs  1m00.0s/2m0s

running (1m01.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  51% ] 100 VUs  1m01.0s/2m0s

running (1m02.0s), 100/100 VUs, 819 complete and 0 interrupted iterations
default   [  52% ] 100 VUs  1m02.0s/2m0s

running (1m03.0s), 100/100 VUs, 827 complete and 0 interrupted iterations
default   [  52% ] 100 VUs  1m03.0s/2m0s

running (1m04.0s), 100/100 VUs, 852 complete and 0 interrupted iterations
default   [  53% ] 100 VUs  1m04.0s/2m0s

running (1m05.0s), 100/100 VUs, 873 complete and 0 interrupted iterations
default   [  54% ] 100 VUs  1m05.0s/2m0s

running (1m06.0s), 100/100 VUs, 896 complete and 0 interrupted iterations
default   [  55% ] 100 VUs  1m06.0s/2m0s

running (1m07.0s), 100/100 VUs, 896 complete and 0 interrupted iterations
default   [  56% ] 100 VUs  1m07.0s/2m0s

running (1m08.0s), 100/100 VUs, 896 complete and 0 interrupted iterations
default   [  57% ] 100 VUs  1m08.0s/2m0s

running (1m09.0s), 100/100 VUs, 896 complete and 0 interrupted iterations
default   [  57% ] 100 VUs  1m09.0s/2m0s

running (1m10.0s), 100/100 VUs, 896 complete and 0 interrupted iterations
default   [  58% ] 100 VUs  1m10.0s/2m0s

running (1m11.0s), 100/100 VUs, 896 complete and 0 interrupted iterations
default   [  59% ] 100 VUs  1m11.0s/2m0s

running (1m12.0s), 100/100 VUs, 896 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  1m12.0s/2m0s

running (1m13.0s), 100/100 VUs, 899 complete and 0 interrupted iterations
default   [  61% ] 100 VUs  1m13.0s/2m0s

running (1m14.0s), 100/100 VUs, 911 complete and 0 interrupted iterations
default   [  62% ] 100 VUs  1m14.0s/2m0s

running (1m15.0s), 100/100 VUs, 943 complete and 0 interrupted iterations
default   [  62% ] 100 VUs  1m15.0s/2m0s

running (1m16.0s), 100/100 VUs, 984 complete and 0 interrupted iterations
default   [  63% ] 100 VUs  1m16.0s/2m0s

running (1m17.0s), 100/100 VUs, 1003 complete and 0 interrupted iterations
default   [  64% ] 100 VUs  1m17.0s/2m0s

running (1m18.0s), 100/100 VUs, 1024 complete and 0 interrupted iterations
default   [  65% ] 100 VUs  1m18.0s/2m0s

running (1m19.0s), 100/100 VUs, 1058 complete and 0 interrupted iterations
default   [  66% ] 100 VUs  1m19.0s/2m0s

running (1m20.0s), 100/100 VUs, 1080 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  1m20.0s/2m0s

running (1m21.0s), 100/100 VUs, 1112 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  1m21.0s/2m0s

running (1m22.0s), 100/100 VUs, 1125 complete and 0 interrupted iterations
default   [  68% ] 100 VUs  1m22.0s/2m0s

running (1m23.0s), 100/100 VUs, 1155 complete and 0 interrupted iterations
default   [  69% ] 100 VUs  1m23.0s/2m0s

running (1m24.0s), 100/100 VUs, 1182 complete and 0 interrupted iterations
default   [  70% ] 100 VUs  1m24.0s/2m0s

running (1m25.0s), 100/100 VUs, 1201 complete and 0 interrupted iterations
default   [  71% ] 100 VUs  1m25.0s/2m0s

running (1m26.0s), 100/100 VUs, 1228 complete and 0 interrupted iterations
default   [  72% ] 100 VUs  1m26.0s/2m0s

running (1m27.0s), 100/100 VUs, 1249 complete and 0 interrupted iterations
default   [  72% ] 100 VUs  1m27.0s/2m0s

running (1m28.0s), 100/100 VUs, 1278 complete and 0 interrupted iterations
default   [  73% ] 100 VUs  1m28.0s/2m0s

running (1m29.0s), 100/100 VUs, 1300 complete and 0 interrupted iterations
default   [  74% ] 100 VUs  1m29.0s/2m0s

running (1m30.0s), 100/100 VUs, 1327 complete and 0 interrupted iterations
default   [  75% ] 100 VUs  1m30.0s/2m0s

running (1m31.0s), 100/100 VUs, 1351 complete and 0 interrupted iterations
default   [  76% ] 100 VUs  1m31.0s/2m0s

running (1m32.0s), 100/100 VUs, 1372 complete and 0 interrupted iterations
default   [  77% ] 100 VUs  1m32.0s/2m0s

running (1m33.0s), 100/100 VUs, 1400 complete and 0 interrupted iterations
default   [  77% ] 100 VUs  1m33.0s/2m0s

running (1m34.0s), 100/100 VUs, 1425 complete and 0 interrupted iterations
default   [  78% ] 100 VUs  1m34.0s/2m0s

running (1m35.0s), 100/100 VUs, 1455 complete and 0 interrupted iterations
default   [  79% ] 100 VUs  1m35.0s/2m0s

running (1m36.0s), 100/100 VUs, 1482 complete and 0 interrupted iterations
default   [  80% ] 100 VUs  1m36.0s/2m0s

running (1m37.0s), 100/100 VUs, 1503 complete and 0 interrupted iterations
default   [  81% ] 100 VUs  1m37.0s/2m0s

running (1m38.0s), 100/100 VUs, 1528 complete and 0 interrupted iterations
default   [  82% ] 100 VUs  1m38.0s/2m0s

running (1m39.0s), 100/100 VUs, 1553 complete and 0 interrupted iterations
default   [  82% ] 100 VUs  1m39.0s/2m0s

running (1m40.0s), 100/100 VUs, 1576 complete and 0 interrupted iterations
default   [  83% ] 100 VUs  1m40.0s/2m0s

running (1m41.0s), 100/100 VUs, 1608 complete and 0 interrupted iterations
default   [  84% ] 100 VUs  1m41.0s/2m0s

running (1m42.0s), 100/100 VUs, 1626 complete and 0 interrupted iterations
default   [  85% ] 100 VUs  1m42.0s/2m0s

running (1m43.0s), 100/100 VUs, 1664 complete and 0 interrupted iterations
default   [  86% ] 100 VUs  1m43.0s/2m0s

running (1m44.0s), 100/100 VUs, 1685 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  1m44.0s/2m0s

running (1m45.0s), 100/100 VUs, 1706 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  1m45.0s/2m0s

running (1m46.0s), 100/100 VUs, 1738 complete and 0 interrupted iterations
default   [  88% ] 100 VUs  1m46.0s/2m0s

running (1m47.0s), 100/100 VUs, 1764 complete and 0 interrupted iterations
default   [  89% ] 100 VUs  1m47.0s/2m0s

running (1m48.0s), 100/100 VUs, 1794 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  1m48.0s/2m0s

running (1m49.0s), 100/100 VUs, 1814 complete and 0 interrupted iterations
default   [  91% ] 100 VUs  1m49.0s/2m0s

running (1m50.0s), 100/100 VUs, 1842 complete and 0 interrupted iterations
default   [  92% ] 100 VUs  1m50.0s/2m0s

running (1m51.0s), 100/100 VUs, 1870 complete and 0 interrupted iterations
default   [  92% ] 100 VUs  1m51.0s/2m0s

running (1m52.0s), 100/100 VUs, 1900 complete and 0 interrupted iterations
default   [  93% ] 100 VUs  1m52.0s/2m0s

running (1m53.0s), 100/100 VUs, 1925 complete and 0 interrupted iterations
default   [  94% ] 100 VUs  1m53.0s/2m0s

running (1m54.0s), 100/100 VUs, 1950 complete and 0 interrupted iterations
default   [  95% ] 100 VUs  1m54.0s/2m0s

running (1m55.0s), 100/100 VUs, 1973 complete and 0 interrupted iterations
default   [  96% ] 100 VUs  1m55.0s/2m0s

running (1m56.0s), 100/100 VUs, 2005 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  1m56.0s/2m0s

running (1m57.0s), 100/100 VUs, 2023 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  1m57.0s/2m0s

running (1m58.0s), 100/100 VUs, 2052 complete and 0 interrupted iterations
default   [  98% ] 100 VUs  1m58.0s/2m0s

running (1m59.0s), 100/100 VUs, 2074 complete and 0 interrupted iterations
default   [  99% ] 100 VUs  1m59.0s/2m0s

running (2m00.0s), 100/100 VUs, 2101 complete and 0 interrupted iterations
default   [ 100% ] 100 VUs  2m00.0s/2m0s

running (2m01.0s), 076/100 VUs, 2126 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  2m0s

running (2m02.0s), 045/100 VUs, 2157 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  2m0s

running (2m03.0s), 026/100 VUs, 2176 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  2m0s

running (2m04.0s), 010/100 VUs, 2192 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  2m0s

running (2m05.0s), 002/100 VUs, 2200 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  2m0s


  █ THRESHOLDS 

    errors
    ✗ 'rate<0.01' rate=100.00%

    http_req_duration
    ✗ 'p(95)<1000' p(95)=7.94s
    ✗ 'p(99)<2000' p(99)=27.04s

    http_req_failed
    ✗ 'rate<0.05' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 4404   35.027468/s
    checks_succeeded...: 36.64% 1614 out of 4404
    checks_failed......: 63.35% 2790 out of 4404

    ✗ auth status is 200
      ↳  0% — ✓ 0 / ✗ 443
    ✗ status is 200
      ↳  0% — ✓ 0 / ✗ 1759
    ✗ response time < 1000ms
      ↳  91% — ✓ 1614 / ✗ 145
    ✗ clients status is 200
      ↳  0% — ✓ 0 / ✗ 443

    CUSTOM
    errors...............: 100.00% 2645 out of 2645

    HTTP
    http_req_duration....: avg=1.54s min=201.16ms med=260.12ms max=37s   p(90)=774.45ms p(95)=7.94s 
    http_req_failed......: 100.00% 2645 out of 2645
    http_reqs............: 2645    21.03716/s

    EXECUTION
    iteration_duration...: avg=5.54s min=2.23s    med=4.15s    max=42.1s p(90)=6.41s    p(95)=12.24s
    iterations...........: 2202    17.513734/s
    vus..................: 2       min=2            max=100
    vus_max..............: 100     min=100          max=100

    NETWORK
    data_received........: 1.3 MB  10 kB/s
    data_sent............: 483 kB  3.8 kB/s



running (2m05.7s), 000/100 VUs, 2202 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  2m0s
time="2026-01-16T07:28:15-05:00" level=error msg="thresholds on metrics 'errors, http_req_duration, http_req_failed' have been crossed"